import 'package:flutter/material.dart';
import 'package:shamalcompany/card.dart';

class Browser extends StatelessWidget {
  const Browser({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SingleChildScrollView(
        child: Column(
      children: const [
        card(
          name: 'جی پی ئێسی چاودێری کردن و کوژاندنەوەی ئۆتۆمبێل',
          price: 'نرخ: 100,000 دینار',
          imgname: 'img/gps1.png',
          body:
              '''ئامێری تایبەت بە چاودێری کردنی منداڵ لە هەموو عێراقدا ، توانای گوێگرتنت هەیە لەو شوێنەی کە ئامێرەکەی لێیە
تایبەتمەندیەکانی:
١ - شوێنی منداڵەکەت دیاری بکە لە هەموو عێراقدا
٢ - گوێ لە دەنگ و بارودۆخی منداڵەکەت بگرە هەر کات ویستت
٣ - بە شەحن کاردەکات و شەحنەکەی بەشی ٧ حەوت ڕۆژ دەکات
٤ - پێویستی بە سیم کارتێکی تایبەت هەیە
٥ - بۆ ماوەی دە ساڵ کاردەکات
٦ - گرێنتی پێنج ساڵی تەکنیکی ئەکەین ئێمە
٧ - قەبارەی بچوکە و بە ئاسانی بەکاردەهێنرێت
٨ - ئێمە خاوەن بریکاری فەرمی ئەم ئامێرەین و تاکە سەرچاوەی بەدەستهێنانی ئامێرەکەین بە شێوەیەکی یاسایی و ڕێگا پێدراو
بۆ کڕین و داواکردنی ئەم ئامێرە ، یاخود سەردانی کۆمپانیای شەماڵی کوردستان بکەن لە شاری سلێمانی شەقامی سەرەکی توی مەلیک تەنیشت ترافیکی سی مەتری ،
گەیاندنەوە داوای بکەیت لە ڕێگای پەیوەندی کردن بەم ژمارە مۆبایلانەوە بە تەلەفون 07700462525 , 07500462525 یان لە ڕێگای وەتس ئەپ یان ڤایبەرەوە یان لە ڕێگای پەیجی سەرەکی کۆمپانیا لە تۆڕی کۆمەڵایەتی فەیسبوک''',
          length: '4 سانتیمەتر',
          height: '8.5 سانتیمەتر',
          depth: '4 سانتیمەتر',
          moisture: '20% ~ 80%',
          electricity: 'دەوروبەری 60mA(12vDC)',
        ),
        card(
          name: 'جی پی ئێسی چاودێری کردن و کوژاندنەوە و گوێگرتنی ئۆتۆمبێل',
          price: 'نرخ: 100 دۆلار',
          imgname: 'img/gps2.png',
          body:
              '''تەنها لای ئێمە ، لە دوورەوە ئوتومبێلەکەت بکوژێنەرەوە و گوێ لە دەنگی سەرنشینەکانی بگرە و چاودێری سەرجەم جوڵەکانی بکە لە ڕێگای مۆبایلەکەتەوە.
تایبەتمەندیەکانی ئامێرەکە:
١- توانای گوێگرتنت هەیە لە دەنگی هەموو ئەو سەرنشینانەی کە لە ناو ئۆتۆمبێلەکەدان.
٣-سیستەمی دیاریکردنی خێرایی تێدایە و لە خێرایی دیارکراو زیاتر بڕوات ئاگادات دەکاتەوە.
٤-سیستەمی دیاری کردنی ناوچەی چالاکی تێدایە لە کاتی دەرچونی ئۆتۆمبێلەکە لە ناوچەی چالاکی ئاگادارت دەکاتەوە.
٥-بەردەوام شوێنی ئۆتۆمبێلەکەت دەزانیت لە ڕێگای (٩) نەخشەی جیهانیەوە.
٦-تەواوی ئەو شوێنانە خەزن دەکات کە ئۆتۆمبێلەکەت پیایدا تێپەڕیوە.
٧-خێرایی ڕۆشتنی ئۆتۆمبێلەکەت پێدەڵێت ، بۆ هەموو جۆرێکی ئۆتۆمبێل دەبێت.
٨- پێوەری زیرەکی تێدایە و خێرایی و ژمارەی کیلۆمەتری ڕۆشتوو نیشان دەدات بۆ ماوەی (١٠) ساڵ دەیپارێزێت.
٩- لە کاتی فرۆشتنی ئۆتۆمبێل لێدەکرێتەوە و لە ئۆتۆمبێلی تر دەبەسترێت.
١٠- لەلایەن ستافی کارامە و شارەزا جی پی ئێسەکەت بۆ دەبەسترێت.
١١-چاودێری چەندین ئۆتۆمبێل بکە لە یەک مۆبایل یان کۆمپیوتەر یان تابلێت ، وە دەکرێت لە چەندین مۆبایل و دیڤایسەوە چاودێری یەک گروپ یان یەک ئۆتۆمبێل بکەیت.
١٢- سیمکارتێکی کۆڵ سیمکارتی پێویستە.''',
          length: '4.8 سانتیمەتر',
          height: '9.5 سانتیمەتر',
          depth: '1.5 سانتیمەتر',
          moisture: '20% ~ 80%',
          electricity: 'دەوروبەری 60mA(12vDC)',
        ),
        card(
          name: 'جی پی ئێسی چاودێری کردنی ئۆتۆمبێل',
          price: ' نرخ : 30,000 دینار',
          imgname: 'img/gps3.png',
          body:
              '''چاودێری ئوتومبێلەکەت بکە لە هەموو عێراقدا لە ڕێگای شاشەی مۆبایلەکەتەوە .
خۆت بە دوور بگرە لە جی پی ئێسی ستۆک و قاچاخ و ئۆنلاینی بێ ناونیشان ، کۆمپانیای شەماڵی کوردستان تاکە کۆمپانیای فەرمی ڕێپێدراو ، تاکە بریکاری فەرمی کۆمپانیای سینۆتراک لە هەموو عێراق و کوردستاندا .
نرخی ئامێرەکە تەنها ( ٣٠،٠٠٠ سی هەزار دینارە )
بۆ کڕین و داواکردنی ئامێرەکە پەیوەندی بکە بەم ژمارانەوە 07700462525 , 07500462525 گەیاندنمان هەیە بۆ سەرجەم شار و شارۆچکەکانی هەرێمی کوردستان و عێراق
گەیاندن بۆ شاری سلێمانی ٣٠٠٠ سێ هەزار دینار
بۆ هەموو کوردستان ٥٠٠٠ پێنج هەزار دینار
بۆ شاری بەغداد ٧٠٠٠ حەوت هەزار دینار
بۆ شار و شارۆچکەکانی تری عێراق ٩٠٠٠ نۆ هەزار دینار
تایبەتمەندیەکانی ئامێرەکە:
١- بەردەوام شوێنی ئۆتۆمبێلەکەت دەزانیت لە ڕێگەی (٩) نەخشەی جیهانیەوە .
٢- تەواوی ئەو شوێنانە خەزن دەکات کە ئۆتۆمبێلەکەت پیایدا تێپەڕیوە .
٣- خێرایی ڕۆشتنی ئۆتۆمبێلەکەت پێدەڵێت ، بۆ هەموو جۆرێکی ئۆتۆمبێل دەبێت
٤- پێوەری زیرەکی تێدایە و خێرای و ژمارەی کیلۆمەتری ڕۆشتوو نیشان دەدات و بۆماوەی (١٠) ساڵ دیپارێزێت.
٥-لە کاتی فرۆشتنی ئۆتۆمبێل لێدەکرێتەوە و لە ئۆتۆمبێلی تر دەبەسترێت
٦-لە لایەن ستافی کارامە و شارەزا جی پی ئێسەکەت بۆ دەبەسترێت
٧-چاودێری چەندین ئۆتۆمبێل بکە لە یەک مۆبایل یان کۆمپیوتەر یان تابلێت ، وە دەکرێت لە چەندین مۆبایل و دیڤایسەوە جودێری یەک گروپ یان یەک ئوتومبێل بکەیت.
٨- سیمکارتێکی داتا ترانسفێری پێویستە کە کۆمپانیاکەمان تاکە کۆمپانیایە لە هەموو عێراقدا کە سیمکارتی داتا ترانسفێری
ئامادەکردوە بە ئەکتیڤی یەک ساڵ و داتا ترانسفێری یەک ساڵ ، کە نرخی ساڵانەکەی تەنها ١٥٠٠٠ پانزە هەزار دینارە .''',
          length: '8.2 سانتیمەتر',
          height: '2.4 سانتیمەتر',
          depth: '10 سانتیمەتر',
          moisture: '20% ~ 80%',
          electricity: 'دەوروبەری 60mA(12vDC)',
          heat: '(-20) ~ (60) C',
        ),
        card(
          name: 'سیستەمی چاودێری کردنی ماڵ',
          price: 'نرخ: 500 دۆلار',
          imgname: 'img/housewatch.png',
          body: '''لە کاتی:
١-بوونی دز لە ماڵەکەت
٢-ئاگرکەوتنەوە و دوکەڵ
چونی ئاو بۆ ناو ماڵەکەت
دروستبوونی جووڵە و لەرە
ئاگادارکردنەوەت لە لایەن منداڵەکەتەوە''',
          length: '4 سانتیمەتر',
          height: '8.5 سانتیمەتر',
          depth: '4 سانتیمەتر',
          moisture: '20% ~ 80%',
          electricity: 'دەوروبەری 60mA(12vDC)',
        ),
        card(
          name: 'جی پی ئێسی چاودێری کردنی قاسە',
          price: 'نرخ: 300 دۆلار',
          imgname: 'img/gps4.png',
          body: '''١- چاودێری بەردەوامی شوێنی قاسەکەت بۆ ماوەی ١٠ سال .
٢-گرێنتی (٥) ساڵ کارکردن

٣-تۆمارکردنی سەرجەم چاودێری بۆ ماوەی (١٠) ساڵ.
٤-گوێگرتن لە دەنگی دەوروپشتی قاسەکەت هەر کات بتەوێت.
٥-شەحنەکەی بەشی (٤٥) ڕۆژ دەکات .
٦- ئەنتی شەیکە دوای جووڵە دەست دەکات بە تراکینگ.
٧-پێویستی بە هێڵی ئینتەرنێت نیە.
٨-ئەپی تایبەتی خۆی هەیە ب چاودێری کردنی.''',
          length: '4 سانتیمەتر',
          height: '8.5 سانتیمەتر',
          depth: '4 سانتیمەتر',
          moisture: '20% ~ 80%',
          electricity: 'دەوروبەری 60mA(12vDC)',
        ),
        card(
          name: 'جی پی ئێسی چاودێری کردنی منداڵ',
          price: 'نرخ: 100,000 دینار',
          imgname: 'img/gps5.png',
          body: '''١- چاودێری بەردەوامی شوێنی قاسەکەت بۆ ماوەی ١٠ سال .
٢-گرێنتی (٥) ساڵ کارکردن

٣-تۆمارکردنی سەرجەم چاودێری بۆ ماوەی (١٠) ساڵ.
٤-گوێگرتن لە دەنگی دەوروپشتی قاسەکەت هەر کات بتەوێت.
٥-شەحنەکەی بەشی (٤٥) ڕۆژ دەکات .
٦- ئەنتی شەیکە دوای جووڵە دەست دەکات بە تراکینگ.
٧-پێویستی بە هێڵی ئینتەرنێت نیە.
٨-ئەپی تایبەتی خۆی هەیە ب چاودێری کردنی.''',
          length: '4 سانتیمەتر',
          height: '8.5 سانتیمەتر',
          depth: '4 سانتیمەتر',
          moisture: '20% ~ 80%',
          electricity: 'دەوروبەری 60mA(12vDC)',
        ),
        card(
          name: 'کامێرای جاودێری زیرەک',
          price: 'نرخ: 38,000 دینار',
          imgname: 'img/cam.png',
          body:
              '''ئامێری تایبەت بە چاودێری کردنی منداڵ لە هەموو عێراقدا ، توانای گوێگرتنت هەیە لەو شوێنەی کە ئامێرەکەی لێیە
تایبەتمەندیەکانی:
١ - شوێنی منداڵەکەت دیاری بکە لە هەموو عێراقدا
٢ - گوێ لە دەنگ و بارودۆخی منداڵەکەت بگرە هەر کات ویستت
٣ - بە شەحن کاردەکات و شەحنەکەی بەشی ٧ حەوت ڕۆژ دەکات
٤ - پێویستی بە سیم کارتێکی تایبەت هەیە
٥ - بۆ ماوەی دە ساڵ کاردەکات
٦ - گرێنتی پێنج ساڵی تەکنیکی ئەکەین ئێمە
٧ - قەبارەی بچوکە و بە ئاسانی بەکاردەهێنرێت
٨ - ئێمە خاوەن بریکاری فەرمی ئەم ئامێرەین و تاکە سەرچاوەی بەدەستهێنانی ئامێرەکەین بە شێوەیەکی یاسایی و ڕێگا پێدراو
بۆ کڕین و داواکردنی ئەم ئامێرە ، یاخود سەردانی کۆمپانیای شەماڵی کوردستان بکەن لە شاری سلێمانی شەقامی سەرەکی توی مەلیک تەنیشت ترافیکی سی مەتری ،
گەیاندنەوە داوای بکەیت لە ڕێگای پەیوەندی کردن بەم ژمارە مۆبایلانەوە بە تەلەفون 07700462525 , 07500462525 یان لە ڕێگای وەتس ئەپ یان ڤایبەرەوە یان لە ڕێگای پەیجی سەرەکی کۆمپانیا لە تۆڕی کۆمەڵایەتی فەیسبوک''',
          length: '2.8 سانتیمەتر',
          height: '4.5 سانتیمەتر',
          radius: '2 سانتیمەتر',
          moisture: '20% ~ 80%',
          electricity: 'دەوروبەری 60mA(12vDC)',
          batterylife: '٧ ڕۆژ',
          gurante: '٥ ساڵ',
        ),
        card(
          name: 'سیمکارتی تایبەتی جی پی ئێس',
          price: 'نرخ: 15,000 دینار',
          imgname: 'img/sim.png',
          body: ''''١ - پێویستی بە وای فای هەیە ، واتا پیویستی بە ئینتەرنێت هەیە
٢ - ئەپلیکەیشنی خۆی هەیە و لەسەر مۆبایل و تابلێت و ئایپاد کاردەکات
٣-چاودێری کردنی قاسە و منداڵ و جانتا و هەموو کەلوپەلێکی بەنرخ.
٣ - هەر جوڵەیەک لە پێش چاوی کامێراکە دروست ببێت راستەوخۆ تۆماری دەکات
٤ - میمۆری پێویستە و تاوەکو ٣٢ گێگا بایت پشتیوانی دەکات
٥ - دوو کێبڵی تایبەتی هەیە بۆ شەحن کردنەوە و باتریەکەی بۆ ماوەی پێنج کاتژمێر بەرگە دەگرێت
٦ - کەتەلۆکی تایبەتی هەیە و ڕێنمایی بەستنی هەیە
٧ - ئامێرەکە لە ناو پاکەتی تایبەتی خۆیدا و پارێزراوە
٨ - کوالیتی ڤیدیۆی فول ئێچدیە ، و ڤیدیۆی جوان و تۆنی دەنگی بەهێز و بێ خەوشە
٩ - ستاندێکی بچوکی موگناتیسی تایبەتی لەگەڵە بۆ چەسپ کردن و جێگیرکردنی لە کاتی بەکارهێنان
١٠ - بۆ ناوسەیارە و قاصە و ناوماڵ و ئۆفیس و چەندین مەبەستی تر بەکار دەهێنرێت
کۆمپانیای شەماڵی کوردستان تاکە کۆمپانیای فەرمی ڕێگاپێدراوە لە بوارەکەدا و دڵنیای دەداتە کڕیارەکانمان لە ڕووی کوالیتی و بەهێزی بەرهەمەکەوە . ئۆفیسمان لە شاری سلێمانی شەقامی سەرەکی تویمەلیکە
بۆ کڕین و داواکردن ئەتوانن پەیوەندی بکەن بەم ژمارەیەوە 07700462525''',
          length: '5.5 سانتیمەتر',
          height: '5.5 سانتیمەتر',
          radius: '5.5 سانتیمەتر',
          moisture: '20% ~ 80%',
          electricity: 'دەوروبەری 60mA(12vDC)',
        ),
        card(
          name: 'لینک لۆکەیشن جی پی ئێس',
          price: 'نرخ: 30,000 دینار',
          imgname: 'img/linkgps.png',
          body: '''گوێ بگرە لە ئۆفیسەکەت چ باسە
شەحنەکەی بەرگەی ٢٤ کاتژمێر دەگرێت''',
          length: '4 سانتیمەتر',
          height: '8.5 سانتیمەتر',
          depth: '4 سانتیمەتر',
          moisture: '20% ~ 80%',
          electricity: 'دەوروبەری 60mA(12vDC)',
        ),
      ],
    ));
  }
}
