import 'package:flutter/material.dart';
import 'package:shamalcompany/card.dart';

class Browser extends StatelessWidget {
  const Browser({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SingleChildScrollView(
        child: Column(
      children: const [
        card(
          name: 'جی پی ئێسی چاودێری کردن و کوژاندنەوەی ئۆتۆمبێل',
          price: 'نرخ: 100,000 دینار',
          imgname: 'img/gps1.png',
          body: '''ئامێری تایبەت بە چاودێری کردنی منداڵ لە هەموو عێراقدا ، توانای گوێگرتنت هەیە لەو شوێنەی کە ئامێرەکەی لێیە
تایبەتمەندیەکانی:
١ - شوێنی منداڵەکەت دیاری بکە لە هەموو عێراقدا
٢ - گوێ لە دەنگ و بارودۆخی منداڵەکەت بگرە هەر کات ویستت
٣ - بە شەحن کاردەکات و شەحنەکەی بەشی ٧ حەوت ڕۆژ دەکات
٤ - پێویستی بە سیم کارتێکی تایبەت هەیە
٥ - بۆ ماوەی دە ساڵ کاردەکات
٦ - گرێنتی پێنج ساڵی تەکنیکی ئەکەین ئێمە
٧ - قەبارەی بچوکە و بە ئاسانی بەکاردەهێنرێت
٨ - ئێمە خاوەن بریکاری فەرمی ئەم ئامێرەین و تاکە سەرچاوەی بەدەستهێنانی ئامێرەکەین بە شێوەیەکی یاسایی و ڕێگا پێدراو
بۆ کڕین و داواکردنی ئەم ئامێرە ، یاخود سەردانی کۆمپانیای شەماڵی کوردستان بکەن لە شاری سلێمانی شەقامی سەرەکی توی مەلیک تەنیشت ترافیکی سی مەتری ،
گەیاندنەوە داوای بکەیت لە ڕێگای پەیوەندی کردن بەم ژمارە مۆبایلانەوە بە تەلەفون 07700462525 , 07500462525 یان لە ڕێگای وەتس ئەپ یان ڤایبەرەوە یان لە ڕێگای پەیجی سەرەکی کۆمپانیا لە تۆڕی کۆمەڵایەتی فەیسبوک''',
        ),
        // card(
        //   name: 'جی پی ئێسی چاودێری کردن و کوژاندنەوە و گوێگرتنی ئۆتۆمبێل',
        //   price: 'نرخ: 100 دۆلار',
        //   imgname: 'img/gps2.png',
        // ),
        // card(
        //   name: 'جی پی ئێسی چاودێری کردنی ئۆتۆمبێل',
        //   price: ' نرخ : 30,000 دینار',
        //   imgname: 'img/gps3.png',
        // ),
        // card(
        //   name: 'سیستەمی چاودێری کردنی ماڵ',
        //   price: 'نرخ: 500 دۆلار',
        //   imgname: 'img/housewatch.png',
        // ),
        // card(
        //   name: 'کامێرای جاودێری زیرەک',
        //   price: 'نرخ: 38,000 دینار',
        //   imgname: 'img/cam.png',
        // ),
        // card(
        //   name: 'سیمکارتی تایبەتی جی پی ئێس',
        //   price: 'نرخ: 15,000 دینار',
        //   imgname: 'img/sim.png',
        // ),
        // card(
        //   name: 'لینک لۆکەیشن جی پی ئێس',
        //   price: 'نرخ: 30,000 دینار',
        //   imgname: 'img/linkgps.png',
        // ),
      ],
    ));
  }
}
